app/views/posts/edit.html.erb

SELECT COUNT(*) FROM "comments" WHERE ("comments".post_id = 2)
---
	<p class="meta">
		<% if @post.comments.count == 0 %>